docs/Topics/Opinions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-23 Mon 21:06 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Opinions</title>
<meta name="author" content="Elle Najt" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Opinions</h1>
<div id="outline-container-orgd55f3b4" class="outline-2">
<h2 id="orgd55f3b4">Opinions:</h2>
<div class="outline-text-2" id="text-orgd55f3b4">
</div>
<div id="outline-container-org89956bb" class="outline-3">
<h3 id="org89956bb">Make it safe to fail</h3>
<div class="outline-text-3" id="text-org89956bb">
<p>
I like to learn by experimenting with things, so I like it when tools make it safe to fail. I like that it&rsquo;s safe for me to fail, emotionally. Clown has helped a lot with this. So has git.<br />
</p>
</div>
</div>
<div id="outline-container-org6299394" class="outline-3">
<h3 id="org6299394">Fun</h3>
<div class="outline-text-3" id="text-org6299394">
<p>
It&rsquo;s good when tools are fun and create flow. When you&rsquo;re engaged you&rsquo;re at your best, so you should optimize for fun!<br />
</p>

<p>
Recently I&rsquo;ve been applying this <a href="Math.html#orgc53a013">to my mathematical studies as well!</a><br />
</p>
</div>
</div>
<div id="outline-container-orgaa5f762" class="outline-3">
<h3 id="orgaa5f762">Design or modify tools to fit yourself, don&rsquo;t bend yourself to fit tools.</h3>
<div class="outline-text-3" id="text-orgaa5f762">
<p>
Being able to iterate towards a tool that fits you like a glove is one of the beauties of a system like emacs.<br />
</p>
</div>
</div>
<div id="outline-container-orga9a95fe" class="outline-3">
<h3 id="orga9a95fe">Find ways to develop iteratively and build positive feedback loops against reality</h3>
<div class="outline-text-3" id="text-orga9a95fe">
<blockquote>
<p>
&#x2026;mathematical ideas originate in empirics, although the genealogy is sometimes long and obscure. But, once they are so conceived,<br />
the subject begins to live a peculiar life of its own and is better<br />
compared to a creative one, governed by almost entirely aesthetical<br />
motivations, than to anything else and, in particular, to an empirical<br />
science. There is, however, a further point which, I believe, needs<br />
stressing. As a mathematical discipline travels far from its empirical<br />
source, or still more, if it is a second and third generation only<br />
indirectly inspired by ideas coming from &rsquo;reality&rsquo;, it is beset with<br />
very grave dangers. It becomes more and more purely aestheticising,<br />
more and more purely* Tart pour Tart. This need not be bad, if the<br />
field is surrounded by correlated subjects, which still have closer<br />
empirical connections, or if the discipline is under the influence of<br />
men with an exceptionally well-developed taste. But there is a grave<br />
danger that the subject will develop along the line of least resistance,<br />
that the stream, so far from its source, will separate into a multitude<br />
of insignificant branches, and that the discipline will become a disorganised mass of details and complexities. In other words, at a<br />
great distance from its empirical source, or after much &rsquo;abstract&rsquo;<br />
inbreeding, a mathematical subject is in danger of degeneration.<br />
</p>

<p>
&#x2013; von Neumann (from the first paper in his collected works)<br />
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org241cd41" class="outline-3">
<h3 id="org241cd41">Have science buddies!</h3>
<div class="outline-text-3" id="text-org241cd41">
<p>
<a href="https://x.com/ItaiYanai/status/1842787938175697232?t=RKkozqQX7jdShawHQ7rlWA&amp;s=19">&ldquo;Doing good science is 90% finding a science buddy to constantly talk to about the project.&rdquo;</a><br />
</p>
</div>
</div>
<div id="outline-container-org89bc7a0" class="outline-3">
<h3 id="org89bc7a0">You can just get good at things!</h3>
<div class="outline-text-3" id="text-org89bc7a0">
<p>
Useful subskills:<br />
</p>

<ul class="org-ul">
<li>Being able to humble yourself and learn from people who have more knowledge or better heuristics<br /></li>
<li>Agency - you can just do things!<br /></li>
<li>Willingness to be bad and practice; comfort failing repeatedly and comfort working on things that are hard.<br /></li>
<li>Deciding that you can learn something; only you can  defeat learned helplessness.<br /></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Elle Najt</p>
<p class="email">Email: <a href="mailto:LNAJT4@gmail.com">LNAJT4@gmail.com</a></p>
<p class="date">Created: 2026-02-23 Mon 21:06</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 30.2 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
